from utils import *

# fun 取4个值，1表示执行【统计函数】，2表示执行【提取函数】，3表示执行【移动函数】，4表示执行【筛选函数】
fun = 2

############################################################################################################
#   【统计函数】                                                                                           #
#   功能：根据文件名统计信息(编号)：【序号】，【证券代码】，【日期】，【公司简称】，【标题】，【公告序号】 #
#   参数说明：                                                                                             #
#     1.in_path: 公告文本所在的路径                                                                        #
#     2.out_path: 公告文本编码后所在的路径                                                                 #
#     3.out_file: 公告信息文件                                                                             #
#     4.fun: 为1时执行此函数                                                                               #
############################################################################################################
extract_info_by_filename(in_path='txt',
                         out_path='target_txt',
                         out_file='fileinfo.xlsx',
                         fun = fun)


############################################################################################################
#   【提取函数】                                                                                           #
#   功能：根据规则提取信息                                                                                 #
#   参数说明：                                                                                             #
#     1.in_path: 公告文本编码后所在的路径(与【统计函数】的out_path保持一致)                                #
#     2.out_file: 公告信息文件(与【统计函数】的out_file保持一致)                                           #
#     3.rule_names: 规则名列表(保证长度比下一个参数rules的长度小1)                                         #
#     4.rules: 规则列表                                                                                    #
#     5.max_len: 提取信息的最大长度                                                                        #
#     6.fun: 为2时执行此函数                                                                               #
############################################################################################################
# 根据规则提取信息： 1、中间不能有句号；(完成)2、添加一个是否移动的字段；(完成)3、可以同时提取2及以上信息（前中后）(完成)；4、打开编码错误的文件
extract_info_by_rule1(in_path='target_txt',
                      out_file='fileinfo.xlsx',
                      rule_names=['1', '2', '3'],
                      rules=['5.本人不存在', '第', '条所列', '的情形'],
                      max_len=20,
                      fun = fun)


############################################################################################################
#   【移动函数】                                                                                           #
#   功能：移动指定文件到指定文件夹                                                                         #
#   参数说明：                                                                                             #
#     1.in_path: 源文件路径 (与【统计函数】的out_path保持一致)                                             #
#     2.in_file: 公告信息文件(与【统计函数】的out_file保持一致)                                            #
#     3.out_path: 目标文件路径                                                                             #
#     4.fun: 为3时执行此函数                                                                               #
############################################################################################################
move_file(in_path='target_txt',
          in_file='fileinfo.xlsx',
          out_path='分类1',
          fun=fun)


############################################################################################################
#   【筛选函数】                                                                                           #
#   功能：根据文件名筛选文件到指定文件夹                                                                   #
#   参数说明：                                                                                             #
#     1.in_path: 源文件路径, 不限文件格式                                                                  #
#     2.keyword: 搜索的关键字                                                                              #
#     3.out_path: 目标文件路径                                                                             #
#     4.fun: 为4时执行此函数                                                                               #
############################################################################################################
select(in_path='txt',
       keyword='国创高新',
       out_path='筛选结果',
       fun=fun)


############################################################################################################
#   【删除函数】                                                                                           #
#   功能：根据文件名筛选文件到指定文件夹                                                                   #
#   参数说明：                                                                                             #
#     1.in_path: 源文件路径, 不限文件格式                                                                  #
#     2.keyword: 删除的关键字                                                                              #
#     3.fun: 为5时执行此函数                                                                               #
############################################################################################################
rev(in_path='txt',
       keyword='意见',
       fun=fun)