from sentiment_utils import *

# fun 取2个值：1表示执行【统计函数】，2表示执行【分类函数】
fun = 1

############################################################################################################
#   1.【统计函数】                                                                                         #
#   功能：根据文件名统计信息(编号)：【ID】，【文件名】                                                     #
#   参数说明：                                                                                             #
#     1.in_path: 公告文本所在的路径                                                                        #
#     2.out_path: 公告文本编码后所在的路径                                                                 #
#     3.out_file: 公告信息文件                                                                             #
#     4.fun: 为1时执行此函数                                                                               #
############################################################################################################
code_file(in_path='txt',
          out_path='target',
          out_file='codefile.xlsx',
          fun=fun)

############################################################################################################
#   2.【分类函数】                                                                                         #
#   功能：根据规则提取信息                                                                                 #
#   参数说明：                                                                                             #
#     1.in_path: 编码后的文件目录                                                                          #
#     2.in_file: 编码excel文件                                                                             #
#     3.out_file: 分类结果excel文件                                                                        #
#     4.duplicate: 是否去重                                                                                #
#     5.fun: 为2时执行此函数                                                                               #
############################################################################################################
classify(in_path='target',
         in_file='codefile.xlsx',
         out_file='分类结果.xlsx',
         duplicate=True,
         fun=fun)
